000000 IDENTIFICATION DIVISION.   
000000 PROGRAM-ID. zode4.
000000
000000 DATA DIVISION.
000000     WORKING-STORAGE SECTION.
000000     01 NUMC.
000000         05 VAL PIC 9 VALUE 1.
000000         05 NUMC-N PIC 99.
000000     01 PLUSC.
000000         05 VAL PIC 9 VALUE 2.
000000         05 PLUSC-NUM1 USAGE IS POINTER.
000000         05 PLUSC-NUM2 USAGE IS POINTER.
000000     01 MULTC.
000000         05 VAL PIC 9 VALUE 3.
000000         05 MULTC-NUM1 USAGE IS POINTER.
000000         05 MULTC-NUM2 USAGE IS POINTER.

000000     01 HEAD USAGE IS POINTER.
000000     01 TEMP0 PIC 99.
000000     01 TEMP1 PIC 99.
000000     01 TEMP2 PIC 99.
000000     01 TEMP3 PIC 99.
000000     01 ZS-SIZE PIC S9(04) COMP.
000000     01 ZS-TABLE USAGE IS POINTER OCCURS 100 TIMES.
000000     01 RS-SIZE PIC S9(04) COMP.
000000     01 RS-TABLE PIC 99 OCCURS 100 TIMES.

000000     LINKAGE SECTION.
000000     01 POINTER-TEST USAGE IS POINTER.
000000         05 VAL PIC 9.
000000         05 FIELD1 USAGE IS POINTER.
000000         05 FIELD2 USAGE IS POINTER.



000000 PROCEDURE DIVISION.
000000     MOVE 1 TO ZS-SIZE.
000000     MOVE 1 TO RS-SIZE.
000000     PERFORM build-ast.
000000     PERFORM interp1 UNTIL ZS-SIZE = 0.
000000     PERFORM interp2 UNTIL RS-SIZE = 1.
000000     DISPLAY '"' RS-TABLE(1) '"'.
000000     STOP RUN.
000000     build-ast.
000000*        This does not work at all
000000         ALLOCATE PLUSC TO ZS-TABLE(1).
000000         SET ZS-SIZE TO 1.
000000         ALLOCATE NUMC TO PLUSC-NUM1.
000000         SET NUMC-N OF PLUSC-NUM1 TO 3.
000000         ALLOCATE NUMC TO PLUSC-NUM2.
000000         SET NUMC-N OF PLUSC-NUM2 TO 5.
000000        

000000     interp1.
000000         SET ADDRESS OF POINTER-TEST TO ZS-TABLE(ZS-SIZE)
000000         IF VAL OF POINTER-TEST = 1
000000             SET RS-TABLE(RS-SIZE) TO 
000000                 NUMC-N OF ZS-TABLE(ZS-SIZE)
000000             SET RS-SIZE UP BY 1
000000             SET ZS-SIZE DOWN BY 1
000000         ELSE IF VAL OF POINTER-TEST = 2
000000             SET ZS-SIZE UP BY 1
000000             SET ZS-TABLE(ZS-SIZE) 
000000                 TO FIELD1 OF POINTER-TEST
000000             SET ZS-SIZE UP BY 1
000000             SET ZS-TABLE(ZS-SIZE) 
000000                 TO FIELD2 OF POINTER-TEST
000000*            Note: To simplify things even further, we are
000000*                  requiring that the first input of + or * 
000000*                  is a NumC. With this assumption, we will always 
000000*                  find the operation in the 3rd spot on the stack
000000*                  so we are using this to determine operation
000000             SET RS-TABLE(RS-SIZE) TO 0
000000             SET RS-SIZE UP BY 1
000000         END-IF.
000000     interp2.
000000         SET RS-SIZE DOWN BY 2
000000         IF RS-TABLE (RS-SIZE) = 0
000000             SET RS-SIZE UP BY 2
000000             SET TEMP1 TO RS-TABLE (RS-SIZE)
000000             SET RS-SIZE DOWN BY 1
000000             SET TEMP2 TO RS-TABLE (RS-SIZE)
000000             SET RS-SIZE DOWN BY 1
000000             ADD TEMP1 TEMP2 GIVING TEMP3
000000             MOVE TEMP3 TO RS-TABLE (RS-SIZE)
000000         END-IF.
000000 STOP RUN.
